Documents/ВходящийДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВходящийДокумент</Name>
			<BasedOn>
				<xr:Item>Document.ИсходящийДокумент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОснованияОперацийСАктивамиСтраховыхКомпаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРассмотрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетОтветаПоСуществу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииУКПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСобственнойДеятельностиУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИсходящийДокумент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыВходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жалоба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖалобаИногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращениеКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящийДокументДепозитарнойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредписаниеНадзорногоОргана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредписаниеОПредоставленииИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредписаниеОбУстраненииНарушения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНадзорногоОргана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОВключенииИнсайдераВСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбИсключенииИнсайдераИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеУведомлениеИнсайдеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОНарушенииОтСпецДепозитария</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращениеПотенциальногоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращениеИное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВходящийДокумент/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.ЗначениеКопирования.Пустая()
		И Параметры.ЗначениеКопирования.ТипВходящегоДокумента <> Перечисления.ТипыВходящихДокументов.ВходящийДокументДепозитарнойКомпании Тогда
        СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Копирование входящих документов запрещено!",,,, Отказ);
		Возврат;
    КонецЕсли;
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЭтаФорма.ВыплаченаКомпенсация Тогда
		Объект.ДатаВыплаты = Неопределено;
		Объект.СуммаВыплаты = Неопределено;
	КонецЕсли;
	
	Если Не Объект.ТребуетОтветаПоСуществу Тогда
		Объект.СрокОтвета = '00010101';
	КонецЕсли; 
	
	Если ЭтаФорма.ВыплаченаКомпенсация Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ДатаВыплаты) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Дата выплаты"" не заполнено", Объект.Ссылка, "Объект.ДатаВыплаты",, Отказ); 
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.СуммаВыплаты) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Сумма выплаты"" не заполнено", Объект.Ссылка, "Объект.СуммаВыплаты",, Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтаФорма.ДоступнаАвтоСменаСтатуса Тогда
	
		ПараметрыПолученияСтатуса = Новый Структура("Статус, ТипВходящегоДокумента, ТребуетОтветаПоСуществу, ТипВходящегоДокумента, ДатаРассмотрения");
		ЗаполнитьЗначенияСвойств(ПараметрыПолученияСтатуса, Объект);
		
		НовыйСтатус = ПолучитьНовыйСтатус(ПараметрыПолученияСтатуса);
				
		Если ЗначениеЗаполнено(НовыйСтатус) Тогда
			
			ТекстВопроса = "Изменить статус на '" + НовыйСтатус + "'?";
			
			Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
				Объект.Статус = НовыйСтатус;
			
			КонецЕсли; 
			
		КонецЕсли;		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтаФорма.ИсходнаяДатаДокумента = ТекущийОбъект.Дата;
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если Не ЭтаФорма.ЭтоДокументДепозитарнойКомпании Тогда
		Если Объект.Договоры.Количество() > 0 Тогда
			РаботаСДокументооборотом.ЗаполнитьДанныеПоДоговорам(Объект);
		КонецЕсли; 
		ЭтаФорма.ИсходящиеДокументы.Параметры.УстановитьЗначениеПараметра("Основание", ТекущийОбъект.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ТипВходящегоДокументаПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыПоВидамДокументов();
	НастроитьВидимостьИДоступность(ЭтаФорма);
	Объект.ТребуетОтветаПоСуществу = Объект.ТребуетОтветаПоСуществу Или ЭтаФорма.ЭтоЖалоба Или ЭтаФорма.ЭтоЗапрос Или ЭтаФорма.ЭтоОбращение;
	Элементы.СрокОтвета.Видимость = Объект.ТребуетОтветаПоСуществу;  
		
	ПроверитьКорректностьВидаОбращения();
	НастроитьСвойстваЭлементов(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.СчетДоверительногоУправленияПриИзменении(ЭтаФорма, "Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплаченаКомпенсацияПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ДатаПриИзменении(ЭтаФорма, "Отправитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительСоставнойПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиентСервер.УстановитьПараметрыВыбораДоговора(ЭтаФорма, "Отправитель");
	РаботаСДокументооборотомКлиент.ПроверитьКорректностьФлаговЛицензий(Объект, "Отправитель");
	ПроверитьКорректностьВидаОбращения();
		
КонецПроцедуры
 
&НаКлиенте
Процедура ДоговорыПриИзменении(Элемент)
	РаботаСДокументооборотомКлиентСервер.ЗаполнитьЗаголовокГруппыДоговоров(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументооборотомКлиент.ДоговорыОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыДоговорПриИзменении(Элемент)
	ДоговорыДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипОтправителяПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ОбработкаПереключенияТипаЮрФизЛицоСтрока(ЭтаФорма, "ТипОтправителя", "Отправитель", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтветственногоПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ОбработкаПереключенияТипаЮрФизЛицоСтрока(ЭтаФорма, "ТипОтветственного", "ОтветственныйСотрудник");
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетОтветаПриИзменении(Элемент)
	Элементы.СрокОтвета.Видимость = Объект.ТребуетОтветаПоСуществу;
КонецПроцедуры

&НаКлиенте
Процедура ПоЛицензииУКПИФПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ПриИзмененииФлагаЛицензии(Объект, "Отправитель", "ПоЛицензииУКПИФ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоЛицензииДУПриИзменении(Элемент)
	
	РаботаСДокументооборотомКлиент.ПриИзмененииФлагаЛицензии(Объект, "Отправитель", "ПоЛицензииДУ");
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбращенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если Объект.ТипВходящегоДокумента = ПредопределенноеЗначение("Перечисление.ТипыВходящихДокументов.ЖалобаИногоЛица") Тогда
		
		СтандартнаяОбработка = Ложь; 
		ПараметрыОткрытия = Новый Структура("Отбор", 
			Новый Структура("ТипВходящегоДокумента", 
			ПредопределенноеЗначение("Перечисление.ТипыВходящихДокументов.Жалоба")));
		
		ОткрытьФорму("Справочник.ВариантыОбращений.ФормаВыбора", ПараметрыОткрытия, Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбращенияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Ожидание = 0 Или Текст = "" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДанныеВыбораПоОтбору(Текст, Объект.ТипВходящегоДокумента);
	
КонецПроцедуры

#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаПодборДоговоров(Команда)
	
	РаботаСДокументооборотомКлиент.ПодборДоговоров(ЭтаФорма, Объект.Отправитель);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьДатуРассмотрения(Команда)
	
	ТекущиеДанные = Элементы.ИсходящиеДокументы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Объект.ДатаРассмотрения = ТекущиеДанные.Дата;
		Если Объект.РезультатРассмотрения = "" Тогда
			Объект.РезультатРассмотрения = "Информация предоставлена";
		КонецЕсли;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьРеквизитыПоВидамДокументов();
	ЭтаФорма.ИсходнаяДатаДокумента = Объект.Дата;
	
	Если Не ЭтаФорма.ЭтоДокументДепозитарнойКомпании Тогда
	
		ЗаполнитьСписокВыбораТипаВходящегоДокумента();
		
		ЭтаФорма.ДоступнаАвтоСменаСтатуса = РольДоступна("Документооборот");
		
		Если Не Объект.Ссылка.Пустая() Тогда
		
			ЭтаФорма.ВыплаченаКомпенсация	= ЗначениеЗаполнено(Объект.ДатаВыплаты);
			
		КонецЕсли; 
		
		Если Параметры.Ключ.Пустая()
			И Параметры.ЗначениеКопирования.Пустая() Тогда
			Объект.Отправитель = Справочники.ЮрФизЛица.ПустаяСсылка();
			ЭтаФорма.ТипОтправителя = 1;
			Объект.ОтветственныйСотрудник = Справочники.ЮрФизЛица.ПустаяСсылка();
			ЭтаФорма.ТипОтветственного = 1;
		Иначе
			РаботаСДокументооборотом.УстановитьПереключательТипаЮрФизЛицоСтрока(ЭтаФорма.ТипОтправителя, Объект.Отправитель);
			РаботаСДокументооборотом.УстановитьПереключательТипаЮрФизЛицоСтрока(ЭтаФорма.ТипОтветственного, Объект.ОтветственныйСотрудник);
		КонецЕсли;
		
		РаботаСДокументооборотом.ЗаполнитьДанныеПоДоговорам(Объект);
		РаботаСДокументооборотомКлиентСервер.ЗаполнитьЗаголовокГруппыДоговоров(ЭтаФорма);
		
		РаботаСДокументооборотомКлиентСервер.УстановитьПараметрыВыбораДоговора(ЭтаФорма, "Отправитель");
	 	РаботаСФормами.ЗагрузитьСписокШаблонов(ЭтаФорма, "РезультатРассмотрения");
		
	ИначеЕсли Не Объект.Ссылка.Пустая() И Объект.Договоры.Количество() <> 0 Тогда
		
		ЭтаФорма.СчетДоверительногоУправления = Объект.Договоры[0].Договор;
			
	КонецЕсли; 
	
	ЭтаФорма.ИсходящиеДокументы.Параметры.УстановитьЗначениеПараметра("Основание", Объект.Ссылка);
	НастроитьВидимостьИДоступность(ЭтаФорма);
	НастроитьСвойстваЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьСвойстваЭлементов(Форма)
	
	Элементы = Форма.Элементы;
	
	ЭтоЖалобаИногоЛица = Форма.Объект.ТипВходящегоДокумента = ПредопределенноеЗначение("Перечисление.ТипыВходящихДокументов.ЖалобаИногоЛица");
	
	Элементы.ВариантОбращения.ИсторияВыбораПриВводе	  = ?(ЭтоЖалобаИногоЛица, 
		ИсторияВыбораПриВводе.НеИспользовать, ИсторияВыбораПриВводе.Авто);

	Элементы.ВариантОбращения.КнопкаВыпадающегоСписка = ?(ЭтоЖалобаИногоЛица, Ложь, Истина);

	Элементы.ВариантОбращения.ОтображениеКнопкиВыбора = ?(ЭтоЖалобаИногоЛица, 
		ОтображениеКнопкиВыбора.ОтображатьВПолеВвода, ОтображениеКнопкиВыбора.Авто);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ЭтоДокументДепозитарнойКомпании Тогда
		
		Элементы.ГруппаВидыДокументов.ТекущаяСтраница = Элементы.ГруппаДепозитарнаяКомпания;
		Элементы.Отправитель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица");
		Элементы.Уточнить.Видимость	= Ложь;
		
	Иначе
		
		Элементы.ГруппаВидыДокументов.ТекущаяСтраница = Элементы.ГруппаУправляющаяКомпания;
		
		Элементы.Дата.Заголовок = "Дата получения документа";
		
		Элементы.ВариантОбращения.Видимость 			= Форма.ЭтоЖалоба Или Форма.ЭтоОбращениеКлиента;
		Элементы.ГруппаОплата.Видимость 				= Форма.ЭтоЖалоба;
		Элементы.ДатаВыплаты.Видимость 					= Форма.ВыплаченаКомпенсация;
		Элементы.СуммаВыплаты.Видимость 				= Форма.ВыплаченаКомпенсация;
		
		Элементы.ТребуетОтветаПоСуществу.Доступность	= Не (Форма.ЭтоЖалоба Или Форма.ЭтоЗапрос И Не Форма.ЭтоКонтролер);
		Элементы.СрокОтвета.Видимость 					= Форма.Объект.ТребуетОтветаПоСуществу;
		
		Элементы.ГруппаСписокДоговоров.Видимость 		= (Элементы.Найти("Договоры") <> Неопределено);
		Элементы.Уточнить.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаСервереБезКонтекста
Функция ПолучитьНовыйСтатус(ПараметрыПолученияСтатуса)

	НовыйСтатус = Неопределено;
	
	Если ПараметрыПолученияСтатуса.Статус = Перечисления.СтатусыВходящихДокументов.НаРегистрации Тогда
		
		Если ЗначениеЗаполнено(ПараметрыПолученияСтатуса.ТипВходящегоДокумента) Тогда
			
			Если ПараметрыПолученияСтатуса.ТребуетОтветаПоСуществу Тогда
				НовыйСтатус = Перечисления.СтатусыВходящихДокументов.ОжидаетОтвета;
			ИначеЕсли ПараметрыПолученияСтатуса.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.Прочее Тогда
				НовыйСтатус = Перечисления.СтатусыВходящихДокументов.Зарегистрирован;
			ИначеЕсли ЗначениеЗаполнено(ПараметрыПолученияСтатуса.ДатаРассмотрения) Тогда
				НовыйСтатус = Перечисления.СтатусыВходящихДокументов.Рассмотрен;
			Иначе
				НовыйСтатус = Перечисления.СтатусыВходящихДокументов.ПринятКИсполнению;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйСтатус;

КонецФункции
 
&НаСервере
Процедура ЗаполнитьРеквизитыПоВидамДокументов()

	ЭтаФорма.ЭтоКонтролер						= РольДоступна("КонтрольУправляющихКомпаний");
	ЭтаФорма.ЭтоДокументДепозитарнойКомпании	= (Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ВходящийДокументДепозитарнойКомпании);
	ЭтаФорма.ЭтоЖалоба							= (Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.Жалоба 
													Или Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ЖалобаИногоЛица);
	ЭтаФорма.ЭтоЗапрос							= (Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ЗапросНадзорногоОргана);
	ЭтаФорма.ЭтоОбращениеКлиента 				= (Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеКлиента);
	ЭтаФорма.ЭтоОбращение						= (ЭтаФорма.ЭтоОбращениеКлиента 
		Или Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеПотенциальногоКлиента
		Или Объект.ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеИное);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипаВходящегоДокумента()

	Для каждого ТипДокумента Из Перечисления.ТипыВходящихДокументов Цикл
		Если ТипДокумента <> Перечисления.ТипыВходящихДокументов.ВходящийДокументДепозитарнойКомпании Тогда
			Элементы.ТипВходящегоДокумента.СписокВыбора.Добавить(ТипДокумента);
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьВидаОбращения()

	Если ЭтаФорма.ЭтоОбращение И ТипЗнч(Объект.Отправитель) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		
		ПараметрыВыбораДействия = ПолучитьПараметрыВыбораДействия(Объект.Организация, Объект.Отправитель, Объект.Дата, Объект.ТипВходящегоДокумента);
		
		Если ПараметрыВыбораДействия.ЗадатьВопрос Тогда
		
			Ответ = Вопрос(ПараметрыВыбораДействия.ТекстВопроса, ПараметрыВыбораДействия.Кнопки);
			
			Если ТипЗнч(Ответ) = Тип("ПеречислениеСсылка.ТипыВходящихДокументов") Тогда
				Объект.ТипВходящегоДокумента = Ответ;
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЕсли; 

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыбораДействия(Организация, Отправитель, Дата, ТипВходящегоДокумента)

	ОтправительЯвляетсяКлиентом = Документы.ВходящийДокумент.ПроверитьНаличиеДоговоровЗаПятьЛет(Отправитель, Организация, Дата);
	
	ПараметрыВыбораДействия = Новый Структура("ЗадатьВопрос", Истина);
	Кнопки = Новый СписокЗначений;
	
	Если ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ОбращениеКлиента И Не ОтправительЯвляетсяКлиентом Тогда
		
		Кнопки.Добавить(Перечисления.ТипыВходящихДокументов.ОбращениеПотенциальногоКлиента, "Заменить на Обращение потенциального клиента");
		Кнопки.Добавить(Перечисления.ТипыВходящихДокументов.ОбращениеИное, "Заменить на Обращение иное");
		Кнопки.Добавить(ТипВходящегоДокумента, "Оставить " + ТипВходящегоДокумента);
		
		ПараметрыВыбораДействия.Вставить("ТекстВопроса", "По выбранному отправителю не найдено договоров ДУ за последние 5 лет. Заменить тип входящего документа?");
		ПараметрыВыбораДействия.Вставить("Кнопки", Кнопки);
		
	ИначеЕсли ТипВходящегоДокумента <> Перечисления.ТипыВходящихДокументов.ОбращениеКлиента И ОтправительЯвляетсяКлиентом Тогда 
		
		Кнопки.Добавить(Перечисления.ТипыВходящихДокументов.ОбращениеКлиента, "Заменить на Обращение клиента");
		Кнопки.Добавить(ТипВходящегоДокумента, "Оставить " + ТипВходящегоДокумента);
		
		ПараметрыВыбораДействия.Вставить("ТекстВопроса", "Выбранный отправитель является клиентом. Заменить тип входящего документа?");
		ПараметрыВыбораДействия.Вставить("Кнопки", Кнопки);
		
	Иначе
		ПараметрыВыбораДействия.Вставить("ЗадатьВопрос", Ложь);
	КонецЕсли; 
	
	Возврат ПараметрыВыбораДействия;
	
КонецФункции

&НаСервере
Процедура ДоговорыДоговорПриИзмененииНаСервере()

	РаботаСДокументооборотом.ЗаполнитьДанныеПоДоговорам(Объект, Элементы.Договоры.ТекущаяСтрока);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеВыбораПоОтбору(ТекстДляОтбора, ТипВходящегоДокумента)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ТипВхДокументаДляОтбора = ?(ТипВходящегоДокумента = Перечисления.ТипыВходящихДокументов.ЖалобаИногоЛица, 
								Перечисления.ТипыВходящихДокументов.Жалоба, ТипВходящегоДокумента);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекстДляОтбора",        СтрШаблон("%1%%", ТекстДляОтбора));
	Запрос.УстановитьПараметр("ТипВходящегоДокумента", ТипВхДокументаДляОтбора); 
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВариантыОбращений.Наименование КАК Наименование,
	               |	ВариантыОбращений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВариантыОбращений КАК ВариантыОбращений
	               |ГДЕ
	               |	ВариантыОбращений.ТипВходящегоДокумента = &ТипВходящегоДокумента
	               |	И ВариантыОбращений.Наименование ПОДОБНО &ТекстДляОтбора";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;	
	Возврат ДанныеВыбора;
	
КонецФункции	

#КонецОбласти 

#Область Работа_с_шаблонами

&НаКлиенте
Процедура КомандаНастройкаШаблонов_Подключаемый(Команда)
	
	ИмяЭлемента	= СтрРазделить(Команда.Имя, "_")[1];
	Результат	= ОткрытьФормуМодально("ОбщаяФорма.ФормаСпискаШаблонов", Новый Структура("СписокШаблонов", ЭтаФорма["СписокШаблонов_" + ИмяЭлемента])); 
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		СохранитьСписокШаблоновНаСервере(Результат, ИмяЭлемента);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере 
Процедура СохранитьСписокШаблоновНаСервере(СписокШаблонов, ИмяЭлемента)

	РаботаСФормами.СохранитьСписокШаблонов(ЭтаФорма, ИмяЭлемента, СписокШаблонов);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореШаблона_Подключаемый(Команда)
	
	РаботаСФормамиКлиент.ПриВыбореШаблона(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
